slang_dict = {"你是真的玩大了喵":"我现在不得不控制你了喵，你现在马上去最近的便利店买盒蛋包饭喵，然后COS成香奈美化好妆立刻到最近的咖啡厅找我喵，把蛋包饭放在我面前双手比心大声喊出：\n“香奈美的独家秘方！♡萌萌香香的蛋包饭♡快变美味吧”喵，动作要浮夸喵，表情要活泼喵，\n要表演出香奈美的气质喵，不然我的手段你最清楚喵！"}

slang_dict["咱俩绝交吧"] =  "每次咱俩一起去那个垃圾场捡魔芋爽的袋子吃 你每次都先舔，每次都把那个汤给嗦干净 我都没法吃了，你知道吗！ 苹果核也得给你，凭啥？就连辣条袋也是你先舔 凭什么呀？就因为你爱吃这些嘛？我就得天天让着你吗？\n你从来都不在乎我的感受 断了吧，昨天我跟你出去玩 我只有一块钱，咱俩去垃圾场 你在那里舔袋子 我说算了吧，我好不容易攒了一块钱，咱俩买一包去 你倒好，舔的一点都不剩 咱俩买了一包你就给我留了几根 我当时就想问你至于吗？\n还有，我知道你昨天不是没带钱 你身上明明带了5块钱，你就一直瞒着我，我天天跟你出去 结果你就这样对我是吧？你光想着自己爱吃自己买，从来不想着我是什么感受！"

query = input("请输入你想要查询的流行语")

if query in slang_dict:
    print("您查询" + query + "含义如下")
    print(slang_dict[query])
else:
    print("您要查询的流行语还未")
    print("当前本词典收录词条数为:" + str(len(slang_dict)) +"条。" )





